spec/vcr/Plutto_ClientInvoice/_get_invoices/get_all_the_invoices_instance.yml

---
http_interactions:
- request:
    method: get
    uri: https://sandbox.getplutto.com/api/v1/invoices
    body:
      encoding: UTF-8
      string: "{}"
    headers:
      Authorization:
      - Bearer sk_live_0a641854b17cdfed9e98eb7cd3e9e2bfc2687a37470cc8ce71f31c49e33d037f
      Accept:
      - application/json
      Content-Type:
      - application/json
      Connection:
      - close
      Host:
      - sandbox.getplutto.com
      User-Agent:
      - http.rb/4.4.1
  response:
    status:
      code: 200
      message: OK
    headers:
      Date:
      - Wed, 10 Nov 2021 13:40:57 GMT
      Content-Type:
      - application/json; charset=utf-8
      Transfer-Encoding:
      - chunked
      Connection:
      - close
      X-Frame-Options:
      - SAMEORIGIN
      X-Xss-Protection:
      - 1; mode=block
      X-Content-Type-Options:
      - nosniff
      X-Download-Options:
      - noopen
      X-Permitted-Cross-Domain-Policies:
      - none
      Referrer-Policy:
      - strict-origin-when-cross-origin
      X-Per-Page:
      - '25'
      X-Page:
      - '1'
      X-Total:
      - '13'
      Etag:
      - W/"313409db95372a42a1289b36b1b51eb0"
      Cache-Control:
      - max-age=0, private, must-revalidate
      X-Request-Id:
      - daa3ef30-ddae-4b4b-8380-785dd3964124
      X-Runtime:
      - '0.046885'
      Strict-Transport-Security:
      - max-age=63072000; includeSubDomains
      Vary:
      - Origin
      Via:
      - 1.1 vegur
      Cf-Cache-Status:
      - DYNAMIC
      Expect-Ct:
      - max-age=604800, report-uri="https://report-uri.cloudflare.com/cdn-cgi/beacon/expect-ct"
      Report-To:
      - '{"endpoints":[{"url":"https:\/\/a.nel.cloudflare.com\/report\/v3?s=1wlIbJUgQTS6lntaaJ1XKPx%2B8Gl%2BVVxAOP2JRWpb0CJSBaD%2FwV%2BZpRre0UZWyxPf%2FVBKbTKap2b0F39h448Y2LSvVX1%2FaHXi61fTZhNIYMFnL5laEp6ZJyE7j1yNUlXtezToUJnivHNEMWY%2Bx9GrGdQboE4%3D"}],"group":"cf-nel","max_age":604800}'
      Nel:
      - '{"success_fraction":0,"report_to":"cf-nel","max_age":604800}'
      Server:
      - cloudflare
      Cf-Ray:
      - 6abfb2130a1d6f1f-SCL
      Alt-Svc:
      - h3=":443"; ma=86400, h3-29=":443"; ma=86400, h3-28=":443"; ma=86400, h3-27=":443";
        ma=86400
    body:
      encoding: UTF-8
      string: '{"invoices":[{"id":"invoice_5281dfee1bccb3a5c78f802e","subtotal_cents":0,"tax_cents":0,"discount_cents":0,"currency":"CLP","issue_date":"2021-10-20T15:03:35.113Z","created_at":"2021-10-20T15:03:35.121Z","updated_at":"2021-10-28T21:42:41.920Z","customer_id":"customer_e9585b900c38db249f38f59c","status":"paid","payed_at":null,"payment_method":null,"tax_type":null,"document_id":null,"customer_name":"Phobos","customer_email":"phobos@getplutto.com","details":[{"id":"meter_5ef790a8ee1f2d1710cd2f13","type":"per_unit","meter":"Mudanzas","quantity":0,"description":"0
        x Mudanzas","total_price":0.0}],"billing_information":{"city":"Santiago","country_iso_code":null,"state":"Metropolitana","address":"Av.
        las condes 13240","zip":"7591393","tax_id":"19246648-2","activity":null,"legal_name":"Plutto","phone":"+56992680522"},"total":{"cents":0,"currency_iso":"CLP"}},{"id":"invoice_90e4a5e6753d090766ec2a80","subtotal_cents":15000,"tax_cents":2850,"discount_cents":0,"currency":"CLP","issue_date":"2021-10-25T17:55:18.753Z","created_at":"2021-10-25T17:55:18.760Z","updated_at":"2021-10-28T21:25:31.917Z","customer_id":"customer_aa97aa3f9b0f6bc4b1c8a2a3","status":"created","payed_at":null,"payment_method":null,"tax_type":null,"document_id":null,"customer_name":"Platanus","customer_email":"contact@platan.us","details":[{"id":"price-logic_0ce38b40f4c1752412ac3b72","type":"flat_fee","description":"Básico","total_price":15000.0}],"billing_information":{"city":"Santiago","country_iso_code":"CL","state":"Metropolitana","address":"Av.
        las condes 13240","zip":"7591393","tax_id":"19246648-2","activity":null,"legal_name":"Plutto","phone":"+56992680522"},"total":{"cents":17850,"currency_iso":"CLP"}},{"id":"invoice_a7b88cede610b82c641f0630","subtotal_cents":0,"tax_cents":0,"discount_cents":0,"currency":"CLP","issue_date":"2021-10-28T18:03:13.334Z","created_at":"2021-10-28T18:03:13.338Z","updated_at":"2021-10-28T18:03:13.338Z","customer_id":"customer_b04ef7affc19897cb8a15803","status":"created","payed_at":null,"payment_method":null,"tax_type":null,"document_id":null,"customer_name":"Jumbo","customer_email":"hola@jumbo.cl","details":[{"id":"meter_0c8008dbf7b2e48cf277987e","type":"per_unit","meter":"N°
        de despachos","quantity":0,"description":"0 x N° de despachos","total_price":0.0}],"billing_information":{"city":null,"country_iso_code":"CL","state":null,"address":null,"zip":null,"tax_id":null,"activity":null,"legal_name":null,"phone":null},"total":{"cents":0,"currency_iso":"CLP"}},{"id":"invoice_09e4e38cac084a94966e563e","subtotal_cents":0,"tax_cents":0,"discount_cents":0,"currency":"CLP","issue_date":"2021-10-28T18:05:51.237Z","created_at":"2021-10-28T18:05:51.246Z","updated_at":"2021-10-28T18:05:51.246Z","customer_id":"customer_b04ef7affc19897cb8a15803","status":"created","payed_at":null,"payment_method":null,"tax_type":null,"document_id":null,"customer_name":"Jumbo","customer_email":"hola@jumbo.cl","details":[{"id":"permission-group_648e47e0c9992e7c3d975824","type":"Permissions","description":"Permission
        Group Plan básico","total_price":0.0}],"billing_information":{"city":null,"country_iso_code":"CL","state":null,"address":null,"zip":null,"tax_id":null,"activity":null,"legal_name":null,"phone":null},"total":{"cents":0,"currency_iso":"CLP"}},{"id":"invoice_46209a7d267ae3da0392afa3","subtotal_cents":0,"tax_cents":0,"discount_cents":0,"currency":"CLP","issue_date":"2021-10-28T18:07:52.898Z","created_at":"2021-10-28T18:07:52.903Z","updated_at":"2021-10-28T18:07:52.903Z","customer_id":"customer_b04ef7affc19897cb8a15803","status":"created","payed_at":null,"payment_method":null,"tax_type":null,"document_id":null,"customer_name":"Jumbo","customer_email":"hola@jumbo.cl","details":[{"id":"permission-group_648e47e0c9992e7c3d975824","type":"Permissions","description":"Permission
        Group Plan básico","total_price":0.0}],"billing_information":{"city":null,"country_iso_code":"CL","state":null,"address":null,"zip":null,"tax_id":null,"activity":null,"legal_name":null,"phone":null},"total":{"cents":0,"currency_iso":"CLP"}},{"id":"invoice_7c282ed2a8ae1ef8bb16458d","subtotal_cents":0,"tax_cents":0,"discount_cents":0,"currency":"USD","issue_date":"2021-11-01T00:10:00.387Z","created_at":"2021-11-01T00:10:00.424Z","updated_at":"2021-11-01T00:10:00.424Z","customer_id":"customer_aa97aa3f9b0f6bc4b1c8a2a3","status":"created","payed_at":null,"payment_method":null,"tax_type":null,"document_id":null,"customer_name":"Platanus","customer_email":"contact@platan.us","details":[{"id":"price-logic_cee78398e5de5be385111c53","type":"flat_fee","description":"Chile","total_price":0.0}],"billing_information":{"city":"Santiago","country_iso_code":"CL","state":"Metropolitana","address":"Av.
        las condes 13240","zip":"7591393","tax_id":"19246648-2","activity":null,"legal_name":"Plutto","phone":"+56992680522"},"total":{"cents":0,"currency_iso":"USD"}},{"id":"invoice_f293c19c8dcce5f691bfafb0","subtotal_cents":15000,"tax_cents":2850,"discount_cents":0,"currency":"CLP","issue_date":"2021-11-03T23:55:32.361Z","created_at":"2021-11-03T23:55:32.382Z","updated_at":"2021-11-03T23:55:32.382Z","customer_id":"customer_aa97aa3f9b0f6bc4b1c8a2a3","status":"created","payed_at":null,"payment_method":null,"tax_type":null,"document_id":null,"customer_name":"Platanus","customer_email":"contact@platan.us","details":[{"id":"price-logic_0ce38b40f4c1752412ac3b72","type":"flat_fee","description":"Básico","total_price":15000.0}],"billing_information":{"city":"Santiago","country_iso_code":"CL","state":"Metropolitana","address":"Av.
        las condes 13240","zip":"7591393","tax_id":"19246648-2","activity":null,"legal_name":"Plutto","phone":"+56992680522"},"total":{"cents":17850,"currency_iso":"CLP"}},{"id":"invoice_a72ff2aaa3fbcf5736b4f0bc","subtotal_cents":15000,"tax_cents":2850,"discount_cents":0,"currency":"CLP","issue_date":"2021-11-04T00:09:10.219Z","created_at":"2021-11-04T00:09:10.224Z","updated_at":"2021-11-04T00:09:10.224Z","customer_id":"customer_e9585b900c38db249f38f59c","status":"created","payed_at":null,"payment_method":null,"tax_type":null,"document_id":null,"customer_name":"Phobos","customer_email":"phobos@getplutto.com","details":[{"id":"price-logic_0ce38b40f4c1752412ac3b72","type":"flat_fee","description":"Básico","total_price":15000.0}],"billing_information":{"city":"Santiago","country_iso_code":null,"state":"Metropolitana","address":"Av.
        las condes 13240","zip":"7591393","tax_id":"19246648-2","activity":null,"legal_name":"Plutto","phone":"+56992680522"},"total":{"cents":17850,"currency_iso":"CLP"}},{"id":"invoice_879b32f343932ca6d7270732","subtotal_cents":0,"tax_cents":0,"discount_cents":0,"currency":"USD","issue_date":"2021-11-06T16:54:00.572Z","created_at":"2021-11-06T16:54:00.578Z","updated_at":"2021-11-06T16:54:18.505Z","customer_id":"customer_b6f88a56e342b6f34a4595b6","status":"sent","payed_at":null,"payment_method":null,"tax_type":null,"document_id":null,"customer_name":"Felipe","customer_email":"felipe@getplutto.com","details":[{"id":"price-logic_cee78398e5de5be385111c53","type":"flat_fee","description":"Chile","total_price":0.0}],"billing_information":{"city":null,"country_iso_code":"CL","state":null,"address":null,"zip":null,"tax_id":null,"activity":null,"legal_name":null,"phone":null},"total":{"cents":0,"currency_iso":"USD"}},{"id":"invoice_fc6505b944d8f699377b8640","subtotal_cents":15123,"tax_cents":2873,"discount_cents":0,"currency":"CLP","issue_date":"2021-11-08T14:09:29.062Z","created_at":"2021-11-08T14:09:29.072Z","updated_at":"2021-11-08T14:09:29.072Z","customer_id":"customer_7439352cf50e2616ef8d997a","status":"created","payed_at":null,"payment_method":null,"tax_type":null,"document_id":null,"customer_name":"a","customer_email":"marco@platan.us","details":[{"id":"price-logic_a1516fa0af0e080ef7d0f394","type":"flat_fee","description":"Básico","total_price":15000.0},{"id":"permission-group_dc5b77670da8c8d2de2219c1","type":"Permissions","description":"Permission
        Group wow","total_price":123.0}],"billing_information":{"city":null,"country_iso_code":"CL","state":null,"address":null,"zip":null,"tax_id":null,"activity":null,"legal_name":null,"phone":null},"total":{"cents":17996,"currency_iso":"CLP"}},{"id":"invoice_23f67870c9db2d5b3ac12000","subtotal_cents":15123,"tax_cents":2873,"discount_cents":0,"currency":"CLP","issue_date":"2021-11-09T00:05:00.441Z","created_at":"2021-11-09T00:05:00.470Z","updated_at":"2021-11-09T00:05:00.470Z","customer_id":"customer_7439352cf50e2616ef8d997a","status":"created","payed_at":null,"payment_method":null,"tax_type":null,"document_id":null,"customer_name":"a","customer_email":"marco@platan.us","details":[{"id":"price-logic_a1516fa0af0e080ef7d0f394","type":"flat_fee","description":"Básico","total_price":15000.0},{"id":"permission-group_dc5b77670da8c8d2de2219c1","type":"Permissions","description":"Permission
        Group wow","total_price":123.0}],"billing_information":{"city":null,"country_iso_code":"CL","state":null,"address":null,"zip":null,"tax_id":null,"activity":null,"legal_name":null,"phone":null},"total":{"cents":17996,"currency_iso":"CLP"}},{"id":"invoice_df2a7438ca213bece50a735d","subtotal_cents":15000,"tax_cents":2850,"discount_cents":0,"currency":"CLP","issue_date":"2021-11-09T19:28:27.373Z","created_at":"2021-11-09T19:28:27.379Z","updated_at":"2021-11-09T19:28:27.379Z","customer_id":"customer_7439352cf50e2616ef8d997a","status":"created","payed_at":null,"payment_method":null,"tax_type":null,"document_id":null,"customer_name":"a","customer_email":"marco@platan.us","details":[{"id":"price-logic_0ce38b40f4c1752412ac3b72","type":"flat_fee","description":"Básico","total_price":15000.0}],"billing_information":{"city":null,"country_iso_code":"CL","state":null,"address":null,"zip":null,"tax_id":null,"activity":null,"legal_name":null,"phone":null},"total":{"cents":17850,"currency_iso":"CLP"}},{"id":"invoice_b41dfe0f7f790abd674774ed","subtotal_cents":15000,"tax_cents":2850,"discount_cents":0,"currency":"CLP","issue_date":"2021-11-09T19:30:28.371Z","created_at":"2021-11-09T19:30:28.377Z","updated_at":"2021-11-09T19:30:28.377Z","customer_id":"customer_7439352cf50e2616ef8d997a","status":"created","payed_at":null,"payment_method":null,"tax_type":null,"document_id":null,"customer_name":"a","customer_email":"marco@platan.us","details":[{"id":"price-logic_0ce38b40f4c1752412ac3b72","type":"flat_fee","description":"Básico","total_price":15000.0}],"billing_information":{"city":null,"country_iso_code":"CL","state":null,"address":null,"zip":null,"tax_id":null,"activity":null,"legal_name":null,"phone":null},"total":{"cents":17850,"currency_iso":"CLP"}}]}'
  recorded_at: Wed, 10 Nov 2021 13:40:57 GMT
recorded_with: VCR 6.0.0
